{
  "Books": [
    {
      "title": "Pride and Prejudice",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/14348537-L.jpg",
      "genre": "Romance",
      "synopsis": "In the rolling countryside of Regency England, Elizabeth Bennet, a sharp-witted young woman, lives with her four sisters and fretful mother, who is eager to secure them all advantageous marriages due to their modest circumstances. The arrival of the charming Mr. Bingley and his reserved friend Mr. Darcy at nearby Netherfield Park stirs the small community, setting off a flurry of balls, visits, and whispered speculations. Elizabeth finds herself at odds with Darcy’s aloof demeanor, sparking a lively clash of personalities that draws them into a web of misunderstandings and unspoken tensions. Alongside her family’s quirks—her father’s dry humor, her mother’s matchmaking zeal, and her sisters’ varied pursuits—the story unfolds with a cast of colorful figures like the pompous Mr. Collins and the dashing yet dubious Mr. Wickham, all navigating the delicate dance of love, pride, and social expectation in Austen’s witty exploration of human connection.",
      "pageCount": 432,
      "publishedDate": "1813"
    },
    {
      "title": "Alice's Adventures in Wonderland",
      "author": "Lewis Carroll",
      "cover": "https://covers.openlibrary.org/b/id/10527843-L.jpg",
      "genre": "Fantasy",
      "synopsis": "On a lazy summer afternoon, curious Alice spots a White Rabbit in a waistcoat, hurrying along with a pocket watch and muttering about being late, prompting her to follow him down a peculiar rabbit hole. She tumbles into Wonderland, a strange and whimsical land where she encounters a host of eccentric characters: a grinning Cheshire Cat, a Mad Hatter hosting an endless tea party, and a hot-tempered Queen of Hearts fond of croquet and commands. As Alice navigates this topsy-turvy world—shrinking and growing with mysterious potions and cakes—she faces absurd situations, from debating a philosophical Caterpillar to joining a game with flamingos as mallets. Carroll’s fantastical tale brims with playful riddles and surreal encounters, inviting readers into a dreamlike realm where the rules of reality bend and a young girl’s curiosity leads her through a maze of wonder and oddity.",
      "pageCount": 192,
      "publishedDate": "1865"
    },
    {
      "title": "Wuthering Heights",
      "author": "Emily Brontë",
      "cover": "https://covers.openlibrary.org/b/id/12818862-L.jpg",
      "genre": "Gothic Fiction",
      "synopsis": "Set against the wild, windswept moors of Yorkshire, this brooding tale begins as a curious traveler, Lockwood, rents Thrushcross Grange and learns of the nearby Wuthering Heights, a rugged estate steeped in mystery. There, he meets Heathcliff, a dark and intense man with a stormy past, and hears from the housekeeper Nelly Dean about his deep connection to Catherine Earnshaw, a spirited woman raised alongside him. Their bond, forged in childhood amidst the harsh beauty of the moors, is tested by societal divides and the arrival of the refined Linton family, stirring jealousy and unspoken longing. Brontë weaves a gothic atmosphere of raw emotion and eerie isolation, where the landscape mirrors the turbulent passions of its inhabitants, hinting at a saga of love and conflict that reverberates through the years.",
      "pageCount": 416,
      "publishedDate": "1847"
    },
    {
      "title": "A Christmas Carol",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13299222-L.jpg",
      "genre": "Classic Literature",
      "synopsis": "In the bustling, foggy streets of Victorian London, Ebenezer Scrooge, a miserly old businessman, spends his days counting coins and shunning the cheer of Christmas, much to the dismay of his overworked clerk, Bob Cratchit, and his jovial nephew, Fred. On a chilling Christmas Eve, Scrooge is visited by the ghost of his long-dead partner, Jacob Marley, who appears bound in chains and warns of a spectral journey ahead. Three spirits—the nostalgic Ghost of Christmas Past, the hearty Ghost of Christmas Present, and the ominous Ghost of Christmas Yet to Come—soon arrive, each guiding Scrooge through visions of his life and the lives of those around him, from forgotten joys to present struggles. Dickens’ heartwarming story unfolds as a festive exploration of regret, compassion, and the chance for renewal, set against a backdrop of snowy streets and glowing hearths.",
      "pageCount": 160,
      "publishedDate": "1843"
    },
    {
      "title": "Adventures of Huckleberry Finn",
      "author": "Mark Twain",
      "cover": "https://covers.openlibrary.org/b/id/8157718-L.jpg",
      "genre": "Adventure",
      "synopsis": "Along the muddy banks of the Mississippi River in the pre-Civil War South, Huckleberry Finn, a scrappy boy raised in a rough-and-tumble world, escapes his harsh father and sets out on a raft with Jim, a runaway slave with a gentle spirit. Their journey downstream introduces them to a colorful array of characters: smooth-talking con men, feuding families with rifles at the ready, and townsfolk caught up in their own quirks and prejudices. As Huck and Jim drift through lazy days and starry nights, they navigate the river’s bends and the challenges of a society divided by race and morality, forming a bond that tests Huck’s understanding of right and wrong. Twain’s lively narrative paints a vivid picture of adventure and human complexity, capturing the humor and heart of life along the water’s edge.",
      "pageCount": 366,
      "publishedDate": "1884"
    },
    {
      "title": "The Picture of Dorian Gray",
      "author": "Oscar Wilde",
      "cover": "https://covers.openlibrary.org/b/id/14314858-L.jpg",
      "genre": "Gothic Fiction",
      "synopsis": "In the elegant drawing rooms of Victorian London, Dorian Gray, a young man of striking beauty, becomes the muse of painter Basil Hallward, who captures his likeness in a breathtaking portrait. Introduced to the witty and cynical Lord Henry Wotton, Dorian is swept into a world of hedonistic ideas, sparking a fascination with eternal youth and pleasure that alters his outlook. As he embarks on a life of indulgence, surrounded by the opulence of high society and the shadows of its underbelly, Dorian notices something strange about the portrait that now hangs in his home, hinting at a mysterious connection to his actions. Wilde’s gothic tale weaves a web of beauty, temptation, and introspection, exploring the allure of a life unbound by consequence against the backdrop of a morally rigid era.",
      "pageCount": 254,
      "publishedDate": "1890"
    },
    {
      "title": "Emma",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/9278312-L.jpg",
      "genre": "Romance",
      "synopsis": "In the quaint village of Highbury, Emma Woodhouse, a clever and wealthy young woman, enjoys a life of comfort with her doting, hypochondriac father, free from the pressures of courtship that occupy others. Confident in her judgment, she takes up matchmaking, aiming to guide the romantic fates of friends like the impressionable Harriet Smith, while brushing off the gentle criticisms of her longtime friend, Mr. Knightley. Her plans soon entangle her with a cast of locals—the charming but enigmatic Frank Churchill, the pompous vicar Mr. Elton, and the ever-present gossip of Miss Bates—leading to a series of social missteps and unexpected rivalries. Austen’s lighthearted story unfolds with warmth and irony, painting a portrait of a spirited heroine learning the limits of her influence amid the quiet rhythms of country life.",
      "pageCount": 474,
      "publishedDate": "1815"
    },
    {
      "title": "Oliver Twist",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13300802-L.jpg",
      "genre": "Classic Literature",
      "synopsis": "Born into the grim confines of a workhouse in Victorian England, Oliver Twist, a frail and orphaned boy, grows up under the stern watch of beadles and matrons who offer little kindness or sustenance. Escaping a life of labor and hunger, he makes his way to London, where the sprawling city’s dark alleys draw him into the clutches of Fagin, a crafty old man who oversees a band of young pickpockets, including the sly Artful Dodger. Amidst the bustle of markets and the haze of coal smoke, Oliver meets a mix of characters—some harsh, like the brutal Bill Sikes, and others kinder, like the compassionate Nancy—each shaping his path through a world of crime and hardship. Dickens’ tale paints a stark yet hopeful picture of a child’s resilience, set against the gritty backdrop of a society wrestling with poverty and compassion.",
      "pageCount": 504,
      "publishedDate": "1838"
    },
    {
      "title": "Frankenstein or The Modern Prometheus",
      "author": "Mary Shelley",
      "cover": "https://covers.openlibrary.org/b/id/12356249-L.jpg",
      "genre": "Gothic Fiction",
      "synopsis": "In the shadowed halls of a university in Ingolstadt, Victor Frankenstein, a brilliant and ambitious student, becomes consumed by a daring quest to unlock the secrets of life itself, driven by a mix of scientific curiosity and personal tragedy. Working in isolation, he constructs a being from scavenged parts, bringing it to life in a moment of triumph that quickly turns to dread as he confronts the reality of his creation. The creature, towering and misunderstood, wanders into a world that shuns it, forcing Victor to grapple with the consequences of his actions as their paths begin to intertwine. Shelley’s haunting narrative unfolds across icy landscapes and quiet villages, weaving a tale of creation, responsibility, and the search for belonging in a gothic framework that lingers with unease.",
      "pageCount": 280,
      "publishedDate": "1818"
    },
    {
      "title": "A Tale of Two Cities",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/13301713-L.jpg",
      "genre": "Historical Fiction",
      "synopsis": "Set against the turbulent backdrop of the French Revolution, this sweeping story bridges the bustling streets of London and the restless chaos of Paris, where the lives of a diverse cast begin to converge. Dr. Alexandre Manette, a former prisoner of the Bastille, is reunited with his gentle daughter Lucie after years of confinement, while Charles Darnay, a Frenchman with a complicated heritage, seeks a new life across the Channel. Meanwhile, Sydney Carton, a disillusioned lawyer with a sharp mind dulled by drink, finds himself drawn to Lucie’s quiet strength, setting the stage for a tale of sacrifice and unrest. Dickens crafts a vivid world of cobblestone alleys, revolutionary fervor, and personal struggles, where the echoes of ‘liberty, equality, fraternity’ ripple through the lives of those caught in history’s storm.",
      "pageCount": 448,
      "publishedDate": "1859"
    },
    {
      "title": "The Hound of the Baskervilles",
      "author": "Arthur Conan Doyle",
      "cover": "https://covers.openlibrary.org/b/id/8063264-L.jpg",
      "genre": "Mystery",
      "synopsis": "On the foggy, desolate moors of Dartmoor, Sherlock Holmes and his steadfast companion Dr. Watson are summoned to unravel a chilling mystery tied to the ancient Baskerville family. Sir Charles Baskerville has died under strange circumstances, leaving his heir, Sir Henry, to inherit a grand estate shadowed by tales of a spectral hound that haunts the lineage. As the pair arrives at Baskerville Hall, they encounter a cast of intriguing locals—the secretive Stapleton siblings, a nervous butler, and a rugged farmer—all set against a landscape of eerie mists and hidden dangers. Doyle’s tale blends suspense and intellect, with Holmes’ keen eye sifting through superstition and subtle clues to confront a puzzle that tests the boundaries of reason and legend.",
      "pageCount": 256,
      "publishedDate": "1902"
    },
    {
      "title": "The Adventures of Sherlock Holmes",
      "author": "Arthur Conan Doyle",
      "cover": "https://covers.openlibrary.org/b/id/6717853-L.jpg",
      "genre": "Mystery",
      "synopsis": "From the gaslit rooms of 221B Baker Street, Sherlock Holmes, the master of deduction, and his loyal friend Dr. Watson tackle a dozen intriguing cases that illuminate the shadows of Victorian London. Clients arrive with tales of stolen jewels, mysterious societies, and perplexing disappearances, each presenting a challenge that Holmes meets with his trademark pipe, violin, and razor-sharp mind. Whether it’s a red-headed pawnbroker with a curious job offer or a governess fearing for her safety, the stories unfold with a mix of quirky characters—think cunning thieves, desperate heirs, and secretive lodgers—and the city’s foggy streets as a backdrop. Doyle’s collection captures the thrill of the chase and the quiet brilliance of observation, offering a window into a world where every detail holds a story waiting to be uncovered.",
      "pageCount": 336,
      "publishedDate": "1892"
    },
    {
      "title": "The Mysterious Affair at Styles",
      "author": "Agatha Christie",
      "cover": "https://covers.openlibrary.org/b/id/13699667-L.jpg",
      "genre": "Mystery",
      "synopsis": "At Styles Court, a sprawling country manor in the English countryside, the sudden death of its wealthy matriarch, Emily Inglethorp, disrupts the household and draws the attention of Hercule Poirot, a meticulous Belgian detective with a flair for order. Captain Hastings, recovering from war wounds, narrates as Poirot arrives to investigate, greeted by a family full of secrets: a much-younger husband, a pair of stepsons with strained ties, and a lively young companion. The air buzzes with suspicion as Poirot examines locked rooms, cryptic notes, and the lingering scent of poison, his ‘little grey cells’ humming with curiosity. Christie’s debut introduces a classic whodunit, rich with misdirection and the quiet charm of a rural estate hiding more than it reveals.",
      "pageCount": 296,
      "publishedDate": "1921"
    },
    {
      "title": "The Secret Adversary",
      "author": "Agatha Christie",
      "cover": "https://covers.openlibrary.org/b/id/14590159-L.jpg",
      "genre": "Mystery",
      "synopsis": "In the lively chaos of post-World War I London, Tommy Beresford and Tuppence Cowley, two spirited friends down on their luck, decide to form ‘The Young Adventurers, Ltd.,’ offering their wits for hire in a city buzzing with change. Their first job comes quickly: a search for a missing woman tied to a secret document lost when the Lusitania sank, pulling them into a shadowy game of intrigue. Pursued by a mysterious figure known only as ‘Mr. Brown,’ they dodge danger through bustling streets and quiet tea rooms, meeting a cast of allies and foes—from a nervous American to a sharp-witted heiress. Christie’s early thriller crackles with energy and light romance, setting the stage for a duo whose pluck and banter shine amid a web of secrets.",
      "pageCount": 330,
      "publishedDate": "1922"
    },
    {
      "title": "The Mystery of Edwin Drood",
      "author": "Charles Dickens",
      "cover": "https://covers.openlibrary.org/b/id/8243336-L.jpg",
      "genre": "Mystery",
      "synopsis": "In the sleepy cathedral town of Cloisterham, where ancient spires cast long shadows, Edwin Drood, a young man with a bright future, navigates life under the watchful eye of his uncle, John Jasper, a choirmaster with a secretive edge. The arrival of the spirited Neville and Helena Landless, twins from afar, stirs the town’s quiet rhythms, especially as tensions simmer around Edwin’s engagement to the delicate Rosa Bud. Jasper’s brooding presence and the town’s undercurrents of unease hint at hidden passions and dark intentions, while a newcomer, Dick Datchery, begins to poke into the community’s corners. Dickens’ unfinished work drapes a gothic veil over its mystery, leaving readers to ponder the fates unfolding in its misty, musical streets.",
      "pageCount": 284,
      "publishedDate": "1870"
    },
    {
      "title": "Little Women",
      "author": "Louisa May Alcott",
      "cover": "https://covers.openlibrary.org/b/id/8243267-L.jpg",
      "genre": "Classic Literature",
      "synopsis": "In a cozy New England home during the Civil War, the four March sisters—Meg, Jo, Beth, and Amy—share a life of modest means with their wise mother, Marmee, while their father serves far away as a chaplain. Meg dreams of elegance, Jo scribbles stories, Beth plays the piano with a shy smile, and Amy sketches her ambitions, each finding joy in small things amidst threadbare dresses and cold winters. Their days unfold with neighbor Laurie, a spirited boy who joins their plays and picnics, and a cast of kin who shape their world, from a gruff aunt to a kindly tutor. Alcott’s warm story glows with the trials and triumphs of girlhood, a timeless portrait of family and growth.",
      "pageCount": 688,
      "publishedDate": "1868"
    },
    {
      "title": "Northanger Abbey",
      "author": "Jane Austen",
      "cover": "https://covers.openlibrary.org/b/id/12567961-L.jpg",
      "genre": "Romance",
      "synopsis": "Catherine Morland, a dreamy girl with a love for gothic novels, leaves her quiet village for the lively spa town of Bath, where balls and new faces promise adventure beyond her simple upbringing. There, she meets the witty Henry Tilney and his warm sister Eleanor, alongside the boisterous Isabella Thorpe and her brother John, who pull her into a whirl of flirtations and friendships. An invitation to Northanger Abbey, the Tilneys’ ancestral home, stirs her imagination with visions of dark secrets, though the reality offers a gentler charm. Austen’s playful tale dances with satire and sweetness, tracing a young woman’s steps into a world of romance and reality.",
      "pageCount": 254,
      "publishedDate": "1818"
    },
    {
      "title": "Ethan Frome",
      "author": "Edith Wharton",
      "cover": "https://covers.openlibrary.org/b/id/8303480-L.jpg",
      "genre": "Tragedy",
      "synopsis": "In the frozen hills of rural New England, Ethan Frome, a quiet farmer, toils on a stark homestead, bound to his ailing wife Zeena in a marriage drained of warmth, their days marked by silence and snow. The arrival of Mattie Silver, Zeena’s bright-eyed cousin, brings a flicker of life to the house, her laughter and energy a stark contrast to the bleak winter landscape. Ethan finds himself drawn to her, caught between duty and a yearning for something more, as the trio moves through a world of icy fields and creaking barns. Wharton’s tale unfolds with a somber grace, sketching a life shaped by hardship and the pull of unspoken desires.",
      "pageCount": 144,
      "publishedDate": "1911"
    },
    {
      "title": "Anna Karenina",
      "author": "Лев Толстой",
      "cover": "https://covers.openlibrary.org/b/id/2560652-L.jpg",
      "genre": "Realist Fiction",
      "synopsis": "In the glittering salons of imperial Russia, Anna Karenina, a poised and striking woman, lives a polished life with her steady husband Alexei and their young son, until a chance meeting with the dashing Count Vronsky stirs her restless heart. Meanwhile, Konstantin Levin, a thoughtful landowner, seeks meaning in the fields and forests, his quiet courtship of Kitty weaving a counterpoint to Anna’s city world. Their stories unfold amid train stations, ballrooms, and rural estates, surrounded by a cast of aristocrats, peasants, and kin who reflect Russia’s shifting tides. Tolstoy’s vast narrative captures the pulse of love, duty, and the search for purpose in a society of splendor and strain.",
      "pageCount": 864,
      "publishedDate": "1878"
    },
    {
      "title": "Jane Eyre",
      "author": "Charlotte Brontë",
      "cover": "https://covers.openlibrary.org/b/id/8235363-L.jpg",
      "genre": "Gothic Fiction",
      "synopsis": "Jane Eyre, a plain but spirited orphan, endures a harsh childhood under a cruel aunt and a bleak school, emerging with a fierce will to carve her own path in Victorian England. Hired as a governess at Thornfield Hall, she tends to the bright young Adele and meets Mr. Rochester, the estate’s brooding master, whose sharp wit and hidden depths draw her in. The mansion’s shadowy corridors and strange sounds hint at secrets, while Jane navigates her place among its servants and visitors, from the kind Mrs. Fairfax to the elegant Blanche Ingram. Brontë’s gothic romance unfolds with strength and mystery, tracing a woman’s quest for love and independence in a world of stone and storm.",
      "pageCount": 532,
      "publishedDate": "1847"
    },
    {
      "title": "The Count of Monte Cristo",
      "author": "Alexandre Dumas",
      "cover": "https://covers.openlibrary.org/b/id/14566393-L.jpg",
      "genre": "Adventure",
      "synopsis": "Edmond Dantès, a young sailor with a bright future, stands on the cusp of happiness in Marseille, engaged to the lovely Mercédès, when jealousy and betrayal land him in the grim cells of the Château d’If. Imprisoned without trial, he meets a fellow captive, the wise Abbé Faria, whose tales and teachings fuel Edmond’s dreams of freedom and a hidden treasure. Years later, he emerges into the world anew, cloaked in wealth and mystery as the Count of Monte Cristo, moving through Paris and beyond with a keen eye on those who wronged him. Dumas’ epic swirls with adventure and intrigue, a grand journey through a man’s transformation and the shadows of justice.",
      "pageCount": 1243,
      "publishedDate": "1844"
    },
    {
      "title": "Uncle Tom's Cabin",
      "author": "Harriet Beecher Stowe",
      "cover": "https://covers.openlibrary.org/b/id/12728198-L.jpg",
      "genre": "Historical Fiction",
      "synopsis": "In the antebellum South, Uncle Tom, a steadfast enslaved man, lives on a Kentucky plantation with his family, his faith a quiet anchor amidst the cruelties of bondage. When debts force his sale, he’s torn from home, crossing paths with Eliza, a young mother fleeing with her child across icy rivers, and a cast of souls—kindly Quakers, harsh traders, and the gentle Eva St. Clare. Their stories weave through fields, cabins, and bustling towns, painting a raw picture of a nation divided by slavery’s weight. Stowe’s heartfelt tale shines with compassion and outrage, a cry against injustice wrapped in the lives of those who endure it.",
      "pageCount": 544,
      "publishedDate": "1852"
    },
    {
      "title": "Harry Potter and the Deathly Hallows",
      "author": "J. K. Rowling",
      "cover": "https://covers.openlibrary.org/b/id/10110415-L.jpg",
      "genre": "Fantasy",
      "synopsis": "Harry Potter, now seventeen, leaves the safety of Hogwarts behind, joining Ron Weasley and Hermione Granger on a perilous quest across a wizarding world darkened by fear and loss. With a mission left by Dumbledore, they roam through misty woods, quiet villages, and hidden lairs, chasing clues tied to mysterious objects and an old tale of magical relics. Pursued by shadowy forces and tested by doubts, the trio leans on their bond, meeting allies like the quirky Lovegoods and foes who wield power with a ruthless hand. Rowling’s final chapter unfolds with magic and heart, a journey through a realm teetering on the edge of hope and shadow.",
      "pageCount": 784,
      "publishedDate": "2007"
    },
    {
      "title": "Tarzan the Invincible",
      "author": "Edgar Rice Burroughs",
      "cover": "https://covers.openlibrary.org/b/id/284443-L.jpg",
      "genre": "Adventure",
      "synopsis": "Tarzan, the jungle-raised lord of Africa’s wilds, swings through dense canopies and roaring rivers, his keen senses attuned to the land he calls home, when outsiders—cold and calculating—encroach with plans that threaten his domain. Led by a determined woman and her crew, they bring machines and motives that clash with the jungle’s untamed pulse, drawing Tarzan into a contest of strength and wits. Allies like his ape kin and foes from distant lands fill the steamy air with tension, as he moves through vine and shadow with a primal grace. Burroughs’ pulpy tale roars with action and the call of the wild, a clash of worlds under a blazing sun.",
      "pageCount": 192,
      "publishedDate": "1931"
    },
    {
      "title": "Cigars of the Pharaoh",
      "author": "Hergé",
      "cover": "https://covers.openlibrary.org/b/id/3325898-L.jpg",
      "genre": "Graphic Novel",
      "synopsis": "Tintin, a plucky young reporter with a shock of hair, boards a ship with his loyal dog Snowy, bound for adventure, only to stumble into a riddle tied to an Egyptian tomb and a strange symbol etched in sand. His trail leads from dusty pyramids to bustling ports, then deep into India’s jungles, where smugglers, fakirs, and shadowy figures weave a web of danger around him. With his knack for trouble and a nose for truth, Tintin dodges traps and unravels clues, joined by bumbling detectives Thomson and Thompson, whose antics add a dash of chaos. Hergé’s vivid tale leaps with humor and peril, a global chase drawn in crisp, bold lines.",
      "pageCount": 62,
      "publishedDate": "1934"
    },
    {
      "title": "Ready Player One",
      "author": "Ernest Cline",
      "cover": "https://covers.openlibrary.org/b/id/8737626-L.jpg",
      "genre": "Science Fiction",
      "synopsis": "In a gritty 2045, where the real world crumbles, Wade Watts escapes into the OASIS, a sprawling virtual universe of neon-lit quests and retro games, crafted by the late genius James Halliday. When Halliday’s death sparks a contest to find a hidden prize within this digital realm, Wade—under his avatar Parzival—dives in, joined by a crew of misfits like Art3mis and Aech, each chasing a dream amid pixelated wonders. They face rivals, from lone players to a ruthless corporation, in a race through 1980s trivia, arcade battles, and virtual cities glowing with possibility. Cline’s tale buzzes with nostalgia and high stakes, a blend of tech and heart in a future tethered to the past.",
      "pageCount": 384,
      "publishedDate": "2011"
    },
    {
      "title": "Into the Wild",
      "author": "Erin Hunter",
      "cover": "https://covers.openlibrary.org/b/id/12720669-L.jpg",
      "genre": "Adventure",
      "synopsis": "Rusty, a curious housecat with a restless spirit, leaves his cushy life to join ThunderClan, one of four feline tribes ruling a forest alive with secrets, becoming Firepaw under the watchful eye of leader Bluestar. Amid towering oaks and rustling ferns, he learns the ways of the wild—hunting, fighting, and honoring the warrior code—while meeting clanmates like the fierce Tigerclaw and the gentle Graypaw. Tensions simmer with rival clans like ShadowClan, their borders marked by scent and claw, pulling Firepaw into a world of loyalty and lurking threats. Hunter’s tale purrs with the thrill of discovery, a young cat’s leap into a realm of fur and fang.",
      "pageCount": 320,
      "publishedDate": "2003"
    },
    {
      "title": "The Honor of the Big Snows",
      "author": "James Oliver Curwood",
      "cover": "https://covers.openlibrary.org/b/id/5820824-L.jpg",
      "genre": "Adventure",
      "synopsis": "In the frozen reaches of Canada’s north, where snow blankets pines and rivers freeze, a rugged soul—perhaps a trapper or trader—faces the wild with a heart tied to honor and the land’s stark beauty. Surrounded by howling winds and the glow of a cabin fire, he moves through a world of fur-clad folk, loyal dogs, and the ever-present call of survival, where trust is hard-won and danger lurks in the frost. Curwood’s story unfolds with the crunch of snow underfoot and the whisper of a tale shaped by the wilderness, a rugged dance of grit and grace against nature’s might. It’s a journey through icy trails, rich with the spirit of a frontier untamed.",
      "pageCount": 320,
      "publishedDate": "1911"
    },
    {
      "title": "The Sword of Summer",
      "author": "Rick Riordan",
      "cover": "https://covers.openlibrary.org/b/id/13012106-L.jpg",
      "genre": "Fantasy",
      "synopsis": "Magnus Chase, a scrappy Boston teen scraping by on the streets, discovers he’s tied to Norse gods when a fiery encounter lands him in Valhalla, a hall of warriors ruled by Odin’s stern gaze. With a magical sword and a destiny he didn’t ask for, he teams with a quirky crew—a fierce Valkyrie, a stylish elf, and a gruff dwarf—to face a world of trolls, giants, and Loki’s sly whispers across the Nine Realms. From city rooftops to misty shores, Magnus stumbles through myths and mischief, his wit as sharp as his blade. Riordan’s tale crackles with humor and myth, a wild ride through a modern saga of gods and guts.",
      "pageCount": 528,
      "publishedDate": "2015"
    },
    {
      "title": "Ghost Ship",
      "author": "Clive Cussler",
      "cover": "https://covers.openlibrary.org/b/id/7278086-L.jpg",
      "genre": "Adventure",
      "synopsis": "Kurt Austin, a daring operative for NUMA, dives into the seas’ depths when a luxury liner vanishes, its fate a puzzle tied to whispers of a high-stakes scheme lurking beneath the waves. With his trusty team—including the quick-thinking Joe Zavala—he sails through sunlit waters and shadowed wrecks, facing foes who wield tech and treachery with equal skill. From ocean swells to hidden ports, their hunt unfolds with gadgets, guts, and the salty tang of adventure, chasing a mystery that ripples far beyond the horizon. Cussler’s thriller surges with action and the pull of the unknown, a nautical chase in a world of sunken secrets.",
      "pageCount": 448,
      "publishedDate": "2014"
    },
    {
      "title": "Floodtide",
      "author": "Frank Yerby",
      "cover": "https://covers.openlibrary.org/b/id/9362782-L.jpg",
      "genre": "Historical Fiction",
      "synopsis": "In the sultry air of antebellum South Carolina, a young man rises from humble roots into a world of sprawling plantations and whispered tensions, his path shaped by ambition and the tides of a changing South. Surrounded by cotton fields, grand houses, and a cast of planters, belles, and restless souls, he navigates a society rich with beauty and shadowed by its own divides. Love and rivalry weave through his days, set against a land where history hums beneath the surface, poised for upheaval. Yerby’s tale flows with drama and the weight of an era, a vivid glimpse into a man’s climb amid the floodtide of time.",
      "pageCount": 384,
      "publishedDate": "1950"
    },
    {
      "title": "Toll the Hounds",
      "author": "Steven Erikson",
      "cover": "https://covers.openlibrary.org/b/id/6684006-L.jpg",
      "genre": "Fantasy",
      "synopsis": "In the sprawling Malazan world, the city of Darujhistan glimmers with torchlight and intrigue, its streets alive with merchants, thieves, and the looming presence of gods who play their own games. Anomander Rake, a dark and ancient lord, watches over his people, while figures like the sly Kruppe and the towering Karsa Orlong move through a tapestry of schemes and shadows. The Hounds of Shadow stir, their howls a distant echo, as the city braces for forces both mortal and divine that gather on its edges. Erikson’s epic unfurls with a dense, poetic sweep, a realm where fate and defiance clash under a sky heavy with portent.",
      "pageCount": 832,
      "publishedDate": "2008"
    },
    {
      "title": "The Government Inspector",
      "author": "Nikolai Gogol",
      "cover": "https://covers.openlibrary.org/b/id/7142248-L.jpg",
      "genre": "Satirical Comedy",
      "synopsis": "In a small Russian town, a rumor spreads that a government inspector will arrive incognito. The corrupt officials are thrown into a panic, scrambling to cover up their maladministration. When a suspicious stranger arrives, they assume he’s the inspector and lavishly entertain him. As the story unfolds, Gogol’s satire exposes the flaws of a corrupt system, critiquing the bureaucracy and corruption of the Russian government. With witty dialogue and absurd situations, the play is a biting commentary on social ills, exploring themes of human folly and self-deception. The result is a timeless and thought-provoking work of satire.",
      "pageCount": 112,
      "publishedDate": "1836"
    }
  ]
}